//##################################################################################################################################################################//
//
// メインヘッダファイル [main.h]
// Author : SUZUKI FUUTA
//
//##################################################################################################################################################################//
#ifndef _MAIN_H_
#define _MAIN_H_
#define _CRT_SECURE_NO_WARNINGS
#define DIRECTINPUT_VERSION	(0x0800)

//=====================================================================================================================================================================//
//　インクルードファイル
//=====================================================================================================================================================================//
#include <windows.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <d3dx9.h>	//描画処理に必要
#include <dinput.h>
#include <xaudio2.h>
#include <XInput.h>

// ImgUiのフォルダ
#include "imgui/imgui.h"
#include "imgui/imgui_impl_dx9.h"
#include "imgui/imgui_impl_win32.h"

#include "renderer.h"

//=====================================================================================================================================================================//
//ライブラリのリンク
//=====================================================================================================================================================================//
#pragma comment(lib, "d3d9.lib")	//描画処理に必要
#pragma comment(lib, "d3dx9.lib")	//拡張ライブラリ
#pragma comment(lib, "dxguid.lib")	//コンポーネント使用に必要
#pragma comment(lib, "dinput8.lib")	//入力処理に必要
#pragma comment(lib, "winmm.lib")	
#pragma comment(lib, "xinput.lib")	

//=====================================================================================================================================================================//
//マクロ定義
//=====================================================================================================================================================================//
#define SCREEN_WIDTH		(1280)
#define SCREEN_HEIGHT		(600)
#define FVF_VERTEX_3D		(D3DFVF_XYZ|D3DFVF_NORMAL|D3DFVF_DIFFUSE|D3DFVF_TEX1)	//頂点フォーマット・頂点座標・頂点カラー・テクスチャ座標
#define FVF_VERTEX_2D		(D3DFVF_XYZRHW|D3DFVF_DIFFUSE|D3DFVF_TEX1)	//頂点フォーマット・頂点座標・頂点カラー・テクスチャ座標
#define NUM_VERTEX			(4)
#define NUM_TRIANGLE		(2)
#define COLOR_WHITE			(D3DXCOLOR(1.0f,1.0f,1.0f,1.0f))
#define VECTOR_ZERO			(D3DXVECTOR3(0.0f,0.0f,0.0f))
#define CLEAR_ZBFF			(1.0f)
#define RHW					(1.0f)
#define COLOR_RED						(255)						// 赤色
#define COLOR_BULUE						(255)						// 青色
#define COLOR_GREEN						(255)						// 緑色
#define COLOR_ALPHA						(255)						// アルファ値


//=====================================================================================================================================================================//
//頂点フォーマットに合わせた構造体
//=====================================================================================================================================================================//
/* 3D */
typedef struct
{
	D3DXVECTOR3 pos;	//頂点座標
	D3DXVECTOR3 nor;	//法線
	D3DCOLOR col;		//頂点カラー
	D3DXVECTOR2 tex;	//テクスチャ座標
}VERTEX_3D;

/* 2D */
typedef struct
{
	D3DXVECTOR3 pos;	//頂点座標
	float rhw;			//1.0で固定
	D3DCOLOR col;		//頂点カラー
	D3DXVECTOR2 tex;	//テクスチャ座標
}VERTEX_2D;

//=====================================================================================================================================================================//
//プロトタイプ宣言
//=====================================================================================================================================================================//
int GetFPS(void);

#endif // !_MAIN_H_

