//##################################################################################################################################################################//
//
// モデルヘッダファイル [player.h]
// Author : SUZUKI FUUTA
//
//##################################################################################################################################################################//
#ifndef _PLAYERL_H_
#define _PLAYERL_H_


//=====================================================================================================================================================================//
// インクルード
//=====================================================================================================================================================================//
#include "main.h"



//=====================================================================================================================================================================//
// マクロ
//=====================================================================================================================================================================//
#define MODEL_MAX			(2)



//=====================================================================================================================================================================//
// 列挙型
//=====================================================================================================================================================================//
typedef enum
{
	MOTION_TYPE_NOMAL = 0,
	MOTION_TYPE_MOVE,
	MOTION_TYPE_ATTACK,
	MOTION_TYPE_MAX
}MOTION_TYPE;



//=====================================================================================================================================================================//
// 構造体
//=====================================================================================================================================================================//
typedef struct
{
	D3DXVECTOR3 pos;				// 位置
	D3DXVECTOR3 move;				// 移動量
	D3DXVECTOR3 rot;				// 回転
	D3DXMATRIX mtxWorld;			// ワールドマトリックス
	LPD3DXMESH pMesh;				// メッシュへのポインタ
	LPD3DXBUFFER pBuffMat;			// マテリアルへのポインタ
	DWORD NumMat;					// マテリアルの数
	int nIdxModelParent;			// 親モデルのインデックス
	D3DXVECTOR3 g_VtxMinModel;		// モデルの最小値（MIN）
	D3DXVECTOR3	g_VtxMaxModel;		// モデルの最大値（MAX）

}Model;		// モデル

typedef struct
{
	/* 位置 */
	float Pos_X;
	float Pos_Y;
	float Pos_Z;

	/* 回転 */
	float Rot_X;
	float Rot_Y;
	float Rot_Z;
}KEY;	// キー

typedef struct
{
	int nFrame;						// 再生フレーム
	KEY aKey[MODEL_MAX];					// 各モデルのキー要素[パーツの総数]
}KEY_INFO;	// キーの情報の構造体

typedef struct
{
	bool bLoop;				// ループの有・無
	int nNumKey;			// キーの総数
	KEY_INFO aKeyInfo[2];	// キー情報[キーの最大数]
}MOTION_INFO;	// モーション情報構造体

typedef struct
{
	/* プレイヤー情報 */
	D3DXVECTOR3 pos;				// 位置
	D3DXVECTOR3 oldpos;				// 過去の位置
	D3DXVECTOR3 rot;				// 回転
	D3DXVECTOR3 rotDest;			// 回転目的
	D3DXVECTOR3 move;				// 移動量
	D3DXMATRIX mtxWorld;			// ワールドマトリックス

	/* モデル情報 */
	Model aModel[2];				// モデルパーツ[数]
	int nNumModel;					// モデルパーツ数

	/* 影 */
	int nNumShadow;					// 影

	/* モーション */
	MOTION_INFO aMotionInfo[1];		// モーション情報[モーション最大数]
	bool bLoopMotion;				// ループ有・無
	int nKey_No;					// キーNo
	int nCounterMotion;				// モーションカウンター
}Player;	// プレイヤー(見えないモデル)

//=====================================================================================================================================================================//
// プロトタイプ宣言
//=====================================================================================================================================================================//
void InitPlayer(void);
void UninitPlayer(void);
void UpdatePlayer(void);
void DrawPlayer(void);
Player *GetPlayer(void);

#endif // !_MODEL_H_
