//##################################################################################################################################################################//
//
// 地面ヘッダファイル [meshfield.h]
// Author : SUZUKI FUUTA
//
//##################################################################################################################################################################//
#ifndef _MESHFIELD_H_
#define _MESHFIELD_H_


#define LENGTH_POLYGON_X					(1000.0f)								// 中心から各頂点の距離を求める数値
#define LENGTH_POLYGON_Y					(50.0f)									// 中心から各頂点の距離を求める数値
#define LENGTH_POLYGON_Z					(1000.0f)								// 中心から各頂点の距離を求める数値
#define FIELD_POS							(1000.0f)


#include "main.h"

//=====================================================================================================================================================================//
// 構造体
//=====================================================================================================================================================================//
typedef struct
{
	D3DXVECTOR3 pos;							//位置
	D3DXVECTOR3 rot;							//向き
	D3DXMATRIX mtxWorld;						//ワールドマトリックス
	float fWidth;
	float fHeight;
	bool bUse;
}Meshfield;

typedef struct
{
	char *SetData;
	char *EndData;
	char *LoadFile;
	char *InfoData;
	int strlen;
}TexLoad;

//=====================================================================================================================================================================//
// プロトタイプ宣言
//=====================================================================================================================================================================//
HRESULT InitMeshfield(void);
void UninitMeshfield(void);
void UpdateMeshfield(void);
void DrawMeshfield(void);
//void SetMeshfild(D3DXVECTOR3 pos, D3DXVECTOR3 rot, float fWidth, float fHeight);
//void MallocData(void);
Meshfield *GetMeshfield(void);
#endif