//##################################################################################################################################################################//
//
// リザルトヘッダファイル [result.h]
// Author : SUZUKI FUUTA
//
//##################################################################################################################################################################//
#ifndef _RESULT_H_
#define _RESULT_H_

#include "main.h"


//=====================================================================================================================================================================//
// 構造体
//=====================================================================================================================================================================//
typedef struct
{
	D3DXVECTOR3 pos;				// 位置
	D3DXVECTOR3 oldpos;				// 過去の位置
	D3DXVECTOR3 move;				// 移動量
	D3DXVECTOR3 rot;				// 回転
	D3DXVECTOR3 rotDest;			// 回転目的
	D3DXMATRIX mtxWorld;			// ワールドマトリックス
	LPD3DXMESH pMesh;				// メッシュへのポインタ
	LPD3DXBUFFER pBuffMat;			// マテリアルへのポインタ
	LPDIRECT3DTEXTURE9 pTexture;	// テクスチャへのポインタ
	D3DXMATERIAL *pMat;				// マテリアルのポインタ
	DWORD NumMat;					// マテリアルの数
	D3DXVECTOR3 g_VtxMinTitle;		// モデルの最小値（MIN）
	D3DXVECTOR3	g_VtxMaxTitle;		// モデルの最大値（MAX）
}ResultModel;


//=====================================================================================================================================================================//
// プロトタイプ宣言
//=====================================================================================================================================================================//
HRESULT InitResult(void);
void UninitResult(void);
void UpdateResult(void);
void DrawResult(void);

void InitResultModel(void);
void UninitResultModel(void);
void UpdateResultModel(void);
void DrawResultModel(void);
void SetResultModel(void);

#endif // !_RESULT_H_
