//##################################################################################################################################################################//
//
// ポリゴンヘッダファイル [polygon.h]
// Author : SUZUKI FUUTA
//
//##################################################################################################################################################################//
#ifndef _POLYGON_H_
#define _POLYGON_H_

//=====================================================================================================================================================================//
//　インクルードファイル
//=====================================================================================================================================================================//
#include "main.h"
#include <vector>
//=============================================================================
//マクロ
//=============================================================================
#define MAX_OBJECT		(64)


//=============================================================================
//前方宣言
//=============================================================================

using namespace std;

//=============================================================================
// クラス
//=============================================================================
class CPolygon
{
public:
	CPolygon();
	~CPolygon();

	static CPolygon *Create(const D3DXVECTOR3 pos, const D3DXVECTOR3 size);	// インスタンス生成

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	static void DrawAllList(void);
	static void ReleceAllList(void);

	void SetPos(const D3DXVECTOR3 pos);
	void SetSize(const D3DXVECTOR3 size);
	void SetColor(const D3DXCOLOR color);										// 色の設定

private:
	LPDIRECT3DVERTEXBUFFER9 m_pVtxBuff;	// 頂点バッファへのポインタ
	D3DXVECTOR3 m_size;					// ポリゴンのサイズ
	D3DXVECTOR3 m_pos;					// 位置
	static vector<CPolygon*> m_pPolygon;

};




#endif // !_MANAGER_H_
