//##################################################################################################################################################################//
//
// レンダラーヘッダファイル [renderer.h]
// Author : SUZUKI FUUTA
//
//##################################################################################################################################################################//
#ifndef _RENDERER_H_
#define _RENDERER_H_

//=====================================================================================================================================================================//
//　インクルードファイル
//=====================================================================================================================================================================//
#include "main.h"
#include "polygon2d.h"
#include "polygon.h"


//=============================================================================
// クラス
//=============================================================================
class CRenderer
{
public:
	CRenderer();   // コンストラクタ
	~CRenderer();  // デストラクタ

	HRESULT Init(HWND hWnd, bool bWindow);		// 初期化処理
	void Uninit(void);							// 終了処理
	void Update(void);							// 更新処理
	void Draw(void);							// 描画処理

	LPDIRECT3DDEVICE9 GetDevice(void);	// デバイス情報

private:
	LPDIRECT3D9 m_pD3D;							// Direct3Dオブジェクトへのポインタ
	LPDIRECT3DDEVICE9 m_pD3DDevice;				// Direct3Dデバイスへのポインタ

	CPolygon *m_pPolygon;
	CPolygon2d *m_pPolygon2d;
};




#endif // !_RENDERER_H_
