//##################################################################################################################################################################//
//
// ストックヘッダファイル [score.h]
// Author : SUZUKI FUUTA
//
//##################################################################################################################################################################//
#ifndef _STOCK_H_
#define _STOCK_H_

#include "main.h"

// ストックの種類
typedef enum
{
	STOCK_TYPE_PERFECT = 0, 
	STOCK_TYPE_GOOD,
	STOCK_TYPE_BAD,
	STOCK_TYPE_MAX
}STOCK_TYPE;

// ストックの構造体
typedef struct
{
	int nStock;
}STOCK;

//=====================================================================================================================================================================//
// プロトタイプ宣言
//=====================================================================================================================================================================//
HRESULT InitStock(void);
void UninitStock(void);
void UpdateStock(void);
void DrawStock(void);
void AddStock(int nValue ,int Type);
void pVtxSet(int Num);
STOCK *GetStock(void);
#endif 